Repository: assador/ds-findbytags
Catalog: po/*/ds-findbytags.po
Languages: ru

source: structopts(): malloc() failed: insufficient memory.
ru: structopts(): ошибка malloc(): недостаточно памяти.

source: structopts(): Unknown option `-%c'.
ru: structopts(): Неизвестная опция `-%c'.

source: structopts(): Unknown option character `\x%x'.
ru: structopts(): Неизвестный символ опции `\x%x'.

source: structopts(): %s does not exist or is not a directory.
ru: structopts(): %s не существует, или не является каталогом.

source: regexpmatch(): malloc() failed: insufficient memory.
ru: regexpmatch(): ошибка malloc(): недостаточно памяти.

source: regexpmatch_compiled(): malloc() failed: insufficient memory.
ru: regexpmatch_compiled(): ошибка malloc(): недостаточно памяти.

source: strsplit(): malloc() failed: insufficient memory.
ru: strsplit(): ошибка malloc(): недостаточно памяти.

source: strsplit(): realloc() failed: insufficient memory.
ru: strsplit(): ошибка realloc(): недостаточно памяти.

source: regexpcompile(): Regexp compile failed at offset %d: %s
ru: regexpcompile(): Компиляция регулярного выражения не удалась со смещением %d: %s

source: strconcat(): malloc() failed: insufficient memory.
ru: strconcat(): ошибка malloc(): недостаточно памяти.

source: random_name(): malloc() failed: insufficient memory.
ru: random_name(): ошибка malloc(): недостаточно памяти.

source: command_output(): malloc() failed: insufficient memory.
ru: command_output(): ошибка malloc(): недостаточно памяти.

source: command_output(): Cannot into popen.
ru: command_output(): popen(): не могу открыть поток.

source: command_output(): realloc() failed: insufficient memory.
ru: command_output(): ошибка realloc(): недостаточно памяти.

source: command_output(): Cannot into pclose.
ru: command_output(): pclose(): не могу закрыть поток.

source: command_output_lines(): malloc() failed: insufficient memory.
ru: command_output_lines(): ошибка malloc(): недостаточно памяти.

source: command_output_lines(): Cannot into popen.
ru: command_output_lines(): popen(): не могу открыть поток.

source: command_output_lines(): realloc() failed: insufficient memory.
ru: command_output_lines(): ошибка realloc(): недостаточно памяти.

source: command_output_lines(): Cannot into pclose.
ru: command_output_lines(): pclose(): не могу закрыть поток.

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>. C / GTK+ 2 program, that searches in the specified directories the images with keywords (tags) specified in XMP or IPTC metadata and satisfy the specified AND, OR, NOT conditions. Optionally the found images will open in the specified program. Along the way, you can massively add, remove or replace tags in the found images and to save symlinks to these images in the specified directory with original or random names. Read more:
ru: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>. Программа ищет в указанных каталогах изображения с ключевыми словами (тэгами), заданными в метаданных XMP или IPTC и удовлетворяющими заданным логическим условиям И, ИЛИ, НЕ. Опционально найденные изображения откроются в указанной программе. Попутно в найденных изображениях можно массово добавить, удалить или заменить тэги, сохранить ссылки на эти изображения в указанный каталог с оригинальными или случайными именами. Подробнее:

source: Depends: exiv2, libxml2-dev Recommends: gtk2 ds-findbytags [-h] [-g] [-k] [-t path_to_tags_file] [-e encoding] [-a "tag, tag, ..."] [-o "tag, tag, ..."] [-n "tag, tag, ..."] [-i "tag, tag, ..."] [-d "tag, tag, ..."] [-c "tag, tag, [tag, tag], ..."] [-l viewer] [-s path_the_symlinks_are_saved] path(s)_where_to_search -h — (help) — Show help and synopsis information and exit the program. -g — (GUI) — If the key is present, the program runs in the GTK interface instead of the CLI interface. -k — (keep) — If the key is present, the symlinks are named by the names of the files found. In the absence of the key, the symlinks are named by a random character set. -t — (tags) — Path to the XML file with the tags tree in the Geeqie format (by default — $HOME/.config/geeqie/geeqierc.xml). Everything in this file, that is not belong to tags, is ignored. If the path is incorrect, the tags tree is not displayed. Tags from the tree are added by draggging to the required field, or — to the field “AND” — by double-click of the right mouse button. -e — (encoding) — Not implemented yet. Encoding of the Geeqie-formatted XML file with tags (by default — * — autodetect with enca). -a — (and) — File must contain all the tags specified in this key. -o — (or) — File must contain at least one of the specified tags. -n — (not) — File must not contain any of the specified tags. -i — (insert) — Add the tags specified in this key to the found files. -d — (delete) — Delete the specified tags from the found files. -c — (change) — Replace the specified tags in the found files, in pairs. -l — (look) — The program in which the directory with the found files is opened; the default is Geeqie. If you do not need to open it at all, the key value must be “no”. -s — (save) — The directory (absolute path), in which the symlinks to the found files are saved after the end of the program. If the key is not specified, a temporary directory is created at the location of the program start, which after the end of the program is deleted. Example: ds-findbytags -g -k -t "~/.config/geeqie/geeqierc.xml" \ -a "sea, gloomy clouds, stones" -o "birds, dolphins" \ -n "sharks, bees" -i "wow" -d "sea" -c "birds, cats" \ -l "no" -s "~/chosen" ~/photos1 ~/photos2
ru: Зависимости: exiv2, libxml2-dev Рекомендуется: gtk2 ds-findbytags [-h] [-g] [-k] [-t путь_к_файлу_тэгов] [-e кодировка] [-a "тэг, тэг, ..."] [-o "тэг, тэг, ..."] [-n "тэг, тэг, ..."] [-i "тэг, тэг, ..."] [-d "тэг, тэг, ..."] [-c "тэг, тэг, [тэг, тэг], ..."] [-l просмотрщик] [-s путь_к_сохраняемым_ссылкам] путь(-и)_где_искать -h — от help — Показать информацию о программе и синтаксисе её запуска и выйти из неё. -g — от GUI — При наличии ключа скрипт запускается в GTK-интерфейсе вместо CLI-интерфейса. -k — от keep — При наличии ключа ссылки именуются по именам найденных файлов, при отсутствии ключа ссылки именуются случайным набором символов. -t — от tags — Путь к XML-файлу с деревом тэгов в формате Geeqie (по умолчанию — $HOME/.config/geeqie/geeqierc.xml). Всё, не относящееся в этом файле к тэгам, игнорируется. Если неверен, дерево тэгов не показывается. Тэги из дерева добавляются перетаскиванием в нужное поле или, при двойном клике правой кнопкой мыши, в поле «И». -e — от encoding — Кодировка XML-файла тэгов в формате Geeqie (по умолчанию — * — автоопределение с помощью enca). -a — от and — При соответствии каждому из списка тэгов. -o — от or — При соответствии любому из списка тэгов. -n — от not — За исключением любого из списка тэгов. -i — от insert — Добавить тэги в найденные файлы. -d — от delete — Удалить тэги из найденных файлов. -c — от change — Заменить тэги в найденных файлах. -l — от look — Программа, в которой открывается каталог с найденными изображениями; по умолчанию — Geeqie. Если не нужно открывать его вообще, значение ключа должно быть no. -s — от save — Каталог (абсолютный путь), в котором сохраняются ссылки на найденное после окончания работы скрипта. Если ключ не указан, создаётся временный каталог по месту запуска скрипта, который после окончания его работы удаляется. Пример: ds-findbytags -g -k -t "~/.config/geeqie/geeqierc.xml" \ -a "море, серые тучки, камни" -o "чайки, дельфины" \ -n "акулы, люди" -i "ах" -d "море" -c "чайки, птички" \ -l "no" -s "~/chosen" ~/photos1 ~/photos2

source: — Search images by tags and modify tags of found images
ru: — Поиск картинок по тэгам и операции с тэгами найденных картинок

source: Search in
ru: Искать в

source: Add new path to search
ru: Добавить новый путь для поиска

source: Search by tags
ru: Поиск по тэгам

source: Contain all of these tags:
ru: Присутствуют все тэги из:

source: The search is performed for files, which CONTAIN ALL of these tags (separated by commas)
ru: Поиск ведётся по файлам, в которых ПРИСУТСТВУЮТ ВСЕ из перечисленных здесь тэгов (разделённых запятыми)

source: Contain at least one of these tags:
ru: Присутствует хотя бы один тэг из:

source: The search is performed for files, which CONTAIN AT LEAST ONE of these tags (separated by commas)
ru: Поиск ведётся по файлам, в которых ПРИСУТСТВУЕТ ХОТЯ БЫ ОДИН из перечисленных здесь тэгов (разделённых запятыми)

source: Contain no one of these tags:
ru: Нет ни одного тэга из:

source: The search is performed for files, which CONTAIN NO ONE of these tags (separated by commas)
ru: Поиск ведётся по файлам, в которых НЕТ НИ ОДНОГО из перечисленных здесь тэгов (разделённых запятыми)

source: Actions with found
ru: Действия с найденным

source: Add these tags to found files:
ru: Добавить тэги в найденные файлы:

source: ADD these tags (separated by commas) to found files
ru: ДОБАВИТЬ в найденные файлы перечисленные здесь тэги (разделённые запятыми)

source: Delete these tags from found files:
ru: Удалить тэги из найденных файлов:

source: DELETE these tags (separated by commas) from found files
ru: УДАЛИТЬ из найденных файлов перечисленные здесь тэги (разделённые запятыми)

source: Replace tags in found files:
ru: Заменить тэги в найденных файлах:

source: REPLACE in found files some tags with others. Tags in this field are listed pairs with commas. For example, if you enter in this field [sushi, meat, cadillac, motorcycle], then in found files tag “sushi” will be replaced with tag “meat” and tag “cadillac” will be replaced with tag “motorcycle”.
ru: ЗАМЕНИТЬ в найденных файлах одни тэги на другие. Тэги перечисляются в этом поле попарно через запятые. Например, если ввести в это поле [овсянка, борщ, лада калина, мотоцикл], то в найденных файлах тэг «овсянка» заменится на «борщ», а тэг «лада калина» заменится на «мотоцикл».

source: Save symlinks to:
ru: Сохранять ссылки в:

source: If checked, symlinks to found files are saved to the directory, selected righter. It can be useful for albums compilation.
ru: Если отмечено, в выбранном правее каталоге сохраняются символические ссылки на найденные файлы. Это может быть удобно для составления альбомов.

source: Save symlinks to…
ru: Сохранять ссылки в…

source: Directory in which the symlinks to found files are saved
ru: Каталог, в котором сохраняются символические ссылки на найденные файлы.

source: Save names
ru: Сохранять имена

source: If checked, symlinks to found files are saved with names of files themselves. Otherwise symlinks get random names. Set this option only if you are sure that all the files have unique names.
ru: Если отмечено, символические ссылки на найденные файлы сохраняются с именами самих файлов. В противном случае ссылки получают случайные имена. Ставьте эту галочку только если уверены, что все найденные файлы имеют уникальные имена.

source: Start
ru: Начать

source: Start search (and operations with found files if they are specified). The search can take quite a long time, if there is a large number of files.
ru: Начать поиск (и операции с найденными файлами, если они заданы). Поиск может продолжаться довольно долго, если происходит по большому количеству файлов.

source: paths_from_buttons(): malloc() failed: insufficient memory.
ru: paths_from_buttons(): ошибка malloc(): недостаточно памяти.

source: tree(): Cannot open %s.
ru: tree(): Не могу открыть %s.

source: tree(): malloc() failed: insufficient memory.
ru: tree(): ошибка malloc(): недостаточно памяти.

source: tree(): realloc() failed: insufficient memory.
ru: tree(): ошибка realloc(): недостаточно памяти.

source: tree(): Cannot find tags tree in %s.
ru: tree(): Не могу найти дерево тэгов в %s.

source: Search in…
ru: Искать в…

source: This path is already added. Choose another.
ru: Этот путь уже добавлен. Выберите другой.

source: Change the path to search
ru: Изменить путь для поиска

source: Remove the path to search
ru: Удалить путь для поиска

source: wdgt_push(): malloc() failed: insufficient memory.
ru: wdgt_push(): ошибка malloc(): недостаточно памяти.

source: At least one path or -g key must be specified (see below).
ru: По крайней мере один путь или ключ -g должны быть заданы (см. ниже).

source: main(): malloc() failed: insufficient memory.
ru: main(): ошибка malloc(): недостаточно памяти.

source: main(): No paths to search in.
ru: main(): Не выбраны пути для поиска.

source: begin(): malloc() failed: insufficient memory.
ru: begin(): ошибка malloc(): недостаточно памяти.

source: Odd number of tags to replace.
ru: Нечётное количество тэгов для замены.

source: begin(): Odd number of elements in the value of key -c.
ru: begin(): Нечётное количество элементов в значении ключа -c.

source: begin(): Cannot into popen.
ru: begin(): popen(): не могу открыть поток.

source: begin(): realloc() failed: insufficient memory.
ru: begin(): ошибка realloc(): недостаточно памяти.

source: begin(): Cannot into pclose.
ru: begin(): pclose(): не могу закрыть поток.

source: begin(): Cannot create %s.
ru: begin(): Не могу создать %s.

source: actions(): realloc() failed: insufficient memory.
ru: actions(): ошибка realloc(): недостаточно памяти.

source: actions(): malloc() failed: insufficient memory.
ru: actions(): ошибка malloc(): недостаточно памяти.

source: Dmitry Sokolov <dmitry@sokolov.website>
ru: Дмитрий Соколов <dmitry@sokolov.website>

source: C / GTK+ 2 program, that searches in the specified directories the images with keywords (tags) specified in XMP or IPTC metadata and satisfy the specified AND, OR, NOT conditions. Optionally the found images will open in the specified program. Along the way, you can massively add, remove or replace tags in the found images and to save symlinks to these images in the specified directory with original or random names. Depends: exiv2, libxml2-dev. Recommends: gtk2. For more information run the script without any keys or arguments, or with -h key.
ru: Программа (C / GTK+ 2) ищет в указанных каталогах изображения с ключевыми словами (тэгами), заданными в метаданных XMP или IPTC и удовлетворяющими заданным логическим условиям И, ИЛИ, НЕ. Опционально найденные изображения откроются в указанной программе. Попутно в найденных изображениях можно массово добавить, удалить или заменить тэги, сохранить ссылки на эти изображения в указанный каталог с оригинальными или случайными именами. Зависимости: exiv2, libxml2-dev. Рекомендуется: gtk2. Для получения более подробной информации запустите программу без ключей и аргументов или с ключом -h.
